const citys = [
  {
    id: 0,
    city: "广州市",
    districts: [
      "越秀区",
      "荔湾区",
      "海珠区",
      "天河区",
      "白云区",
      "黄埔区",
      "番禺区",
      "花都区",
      "南沙区",
      "萝岗区",
      "增城市",
      "从化市"
    ]
  },
  {
    id: 1,
    city: "深圳市",
    districts: [
      "福田区",
      "罗湖区",
      "南山区",
      "宝安区",
      "龙岗区",
      "盐田区"
    ]
  },
  {
    id: 2,
    city: "清远市",
    districts: [
      "清城区",
      "英德市",
      "连州市",
      "佛冈县",
      "石角镇",
      "阳山县",
      "阳城镇",
      "清新县",
      "太和镇",
      "连山壮族瑶族自治县",
      "吉田镇",
      "连南瑶族自治县",
      "三江镇"
    ]
  },
  {
    id: 3,
    city: "韶关市",
    districts: [
      "浈江区",
      "武江区",
      "曲江区",
      "乐昌市",
      "南雄市",
      "始兴县",
      "太平镇",
      "仁化县",
      "仁化镇",
      "翁源县",
      "龙仙镇",
      "新丰县",
      "乳源瑶族自治县",
      "乳城镇"
    ]
  },
  {
    id: 4,
    city: "河源市",
    districts: [
      "源城区",
      "紫金县",
      "紫城镇",
      "龙川县",
      "老隆镇",
      "连平县",
      "元善镇",
      "和平县",
      "阳明镇",
      "东源县",
      "仙塘镇"
    ]
  },
  {
    id: 5,
    city: "梅州市",
    districts: [
      "梅江区",
      "兴宁市",
      "梅县",
      "程江镇",
      "大埔县",
      "湖寮镇",
      "丰顺县",
      "汤坑镇",
      "五华县",
      "水寨镇",
      "平远县",
      "大柘镇",
      "蕉岭县",
      "蕉城镇"
    ]
  },
  {
    id: 6,
    city: "潮州市",
    districts: [
      "湘桥区",
      "潮安县",
      "庵埠镇",
      "饶平县",
      "黄冈镇"
    ]
  },
  {
    id: 7,
    city: "汕头市",
    districts: [
      "金平区",
      "濠江区",
      "龙湖区",
      "潮阳区",
      "潮南区",
      "澄海区",
      "南澳县",
      "后宅镇"
    ]
  },
  {
    id: 8,
    city: "揭阳市",
    districts: [
      "榕城区",
      "普宁市",
      "揭东县",
      "曲溪镇",
      "揭西县",
      "河婆镇",
      "惠来县",
      "惠城镇"
    ]
  },
  {
    id: 9,
    city: "汕尾市",
    districts: [
      "城区",
      "陆丰市",
      "海丰县",
      "海城镇",
      "陆河县",
      "河田镇"
    ]
  },
  {
    id: 10,
    city: "惠州市",
    districts: [
      "惠城区",
      "惠阳区",
      "博罗县",
      "罗阳镇",
      "惠东县",
      "龙门县"
    ]
  },
  {
    id: 11,
    city: "东莞市",
    districts: [
      "东莞市"
    ]
  },
  {
    id: 12,
    city: "珠海市",
    districts: [
      "香洲区",
      "斗门区",
      "金湾区"
    ]
  },
  {
    id: 13,
    city: "中山市",
    districts: [
      "中山市",
    ]
  },
  {
    id: 14,
    city: "江门市",
    districts: [
      "江海区",
      "蓬江区",
      "新会区",
      "恩平市",
      "台山市",
      "开平市",
      "鹤山市"
    ]
  },
  {
    id: 15,
    city: "佛山市",
    districts: [
      "禅城区",
      "南海区",
      "顺德区",
      "三水区",
      "高明区"
    ]
  },
  {
    id: 16,
    city: "肇庆市",
    districts: [
      "端州区",
      "鼎湖区",
      "高要市",
      "四会市",
      "广宁县",
      "南街镇",
      "怀集县",
      "怀城镇",
      "封开县",
      "江口镇",
      "德庆县"
    ]
  },
  {
    id: 17,
    city: "云浮市",
    districts: [
      "云城区",
      "罗定市",
      "云安县",
      "六都镇",
      "新兴县",
      "新城镇",
      "郁南县",
      "都城镇"
    ]
  },
  {
    id: 18,
    city: "阳江市",
    districts: [
      "江城区",
      "阳春市",
      "阳西县",
      "织镇",
      "阳东县",
      "东城镇"
    ]
  },
  {
    id: 19,
    city: "茂名市",
    districts: [
      "茂南区",
      "茂港区",
      "化州市",
      "信宜市",
      "高州市",
      "电白县",
      "水东镇"
    ]
  },
  {
    id: 20,
    city: "湛江市",
    districts: [
      "赤坎区",
      "霞山区",
      "坡头区",
      "麻章区",
      "吴川市",
      "廉江市",
      "雷州市",
      "遂溪县",
      "遂城镇",
      "徐闻县",
      "撤销广州市东山区",
      "芳村区",
      "设立广州市南沙区",
      "萝岗区"
    ]
  },
]

export {citys}
